Revit 2027 API
BuiltInFailures.StructuralConnectionFailures.StructuralConnectionForbiddenElementInGroup Property
 Fabrication element can not be a group member.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralConnectionForbiddenElementInGroup { get; }
Public Shared ReadOnly Property StructuralConnectionForbiddenElementInGroup As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralConnectionForbiddenElementInGroup {
	FailureDefinitionId^ get ();
}
static member StructuralConnectionForbiddenElementInGroup : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace